In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib

In [4]:
df = pd.read_csv("house_prices.csv")
df.head()

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,...,East,Garden/Park,Sunrise by Kalpataru,2,NaN,1 Covered,Freehold,NaN,NaN,NaN
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,25 Lac,NaN,thane,530 sqft,Ready to Move,1 out of 3,Resale,...,NaN,NaN,NaN,1,1,NaN,NaN,NaN,NaN,NaN
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",1.60 Cr,18824.0,thane,635 sqft,Ready to Move,20 out of 42,Resale,...,West,"Garden/Park, Main Road",TenX Habitat Raymond Realty,2,NaN,1 Covered,Co-operative Society,NaN,NaN,NaN

In [5]:
df.shape

(187531, 21)

In [6]:
df.columns

Index(['Index', 'Title', 'Description', 'Amount(in rupees)',
       'Price (in rupees)', 'location', 'Carpet Area', 'Status', 'Floor',
       'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society',
       'Bathroom', 'Balcony', 'Car Parking', 'Ownership', 'Super Area',
       'Dimensions', 'Plot Area'],
      dtype='object')

In [7]:
df1=df.drop(['Index','Description','Status', 'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society',
             'Balcony', 'Car Parking', 'Ownership', 'Super Area','Dimensions', 'Plot Area','Floor'],axis='columns')
df1.head()

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Bathroom
0,1 BHK Ready to Occupy Flat for sale in Srushti...,42 Lac,6000.0,thane,500 sqft,1
1,2 BHK Ready to Occupy Flat for sale in Dosti V...,98 Lac,13799.0,thane,473 sqft,2
2,2 BHK Ready to Occupy Flat for sale in Sunrise...,1.40 Cr,17500.0,thane,779 sqft,2
3,1 BHK Ready to Occupy Flat for sale Kasheli,25 Lac,NaN,thane,530 sqft,1
4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,1.60 Cr,18824.0,thane,635 sqft,2

In [8]:
df1.head()

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Bathroom
0,1 BHK Ready to Occupy Flat for sale in Srushti...,42 Lac,6000.0,thane,500 sqft,1
1,2 BHK Ready to Occupy Flat for sale in Dosti V...,98 Lac,13799.0,thane,473 sqft,2
2,2 BHK Ready to Occupy Flat for sale in Sunrise...,1.40 Cr,17500.0,thane,779 sqft,2
3,1 BHK Ready to Occupy Flat for sale Kasheli,25 Lac,NaN,thane,530 sqft,1
4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,1.60 Cr,18824.0,thane,635 sqft,2

In [9]:
df1.isnull().sum()

Title                    0
Amount(in rupees)        0
Price (in rupees)    17665
location                 0
Carpet Area          80673
Bathroom               828
dtype: int64

In [10]:
df2 = df1.dropna()
df2.isnull().sum()

Title                0
Amount(in rupees)    0
Price (in rupees)    0
location             0
Carpet Area          0
Bathroom             0
dtype: int64

In [11]:
df2.head()

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Bathroom
0,1 BHK Ready to Occupy Flat for sale in Srushti...,42 Lac,6000.0,thane,500 sqft,1
1,2 BHK Ready to Occupy Flat for sale in Dosti V...,98 Lac,13799.0,thane,473 sqft,2
2,2 BHK Ready to Occupy Flat for sale in Sunrise...,1.40 Cr,17500.0,thane,779 sqft,2
4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,1.60 Cr,18824.0,thane,635 sqft,2
6,1 BHK Ready to Occupy Flat for sale Mumbra,16.5 Lac,2538.0,thane,550 sqft,1

In [12]:
df2.shape

(93615, 6)

In [13]:
import re

df2['Bhk'] = df2['Title'].str.extract(r'(\d+)\s*BHK')

C:\Users\badam\AppData\Local\Temp\ipykernel_14192\561807774.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Bhk'] = df2['Title'].str.extract(r'(\d+)\s*BHK')

In [14]:
df2.head()

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Bathroom,Bhk
0,1 BHK Ready to Occupy Flat for sale in Srushti...,42 Lac,6000.0,thane,500 sqft,1,1
1,2 BHK Ready to Occupy Flat for sale in Dosti V...,98 Lac,13799.0,thane,473 sqft,2,2
2,2 BHK Ready to Occupy Flat for sale in Sunrise...,1.40 Cr,17500.0,thane,779 sqft,2,2
4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,1.60 Cr,18824.0,thane,635 sqft,2,2
6,1 BHK Ready to Occupy Flat for sale Mumbra,16.5 Lac,2538.0,thane,550 sqft,1,1

In [15]:
df3 = df2.drop(['Title'],axis=1)
df3.head()

  Amount(in rupees)  Price (in rupees) location Carpet Area Bathroom Bhk
0           42 Lac              6000.0    thane    500 sqft        1   1
1           98 Lac             13799.0    thane    473 sqft        2   2
2          1.40 Cr             17500.0    thane    779 sqft        2   2
4          1.60 Cr             18824.0    thane    635 sqft        2   2
6         16.5 Lac              2538.0    thane    550 sqft        1   1

In [16]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import LabelEncoder

In [35]:
#le = LabelEncoder()
#x['location'] = le.fit_transform(x['location'])
#x.head()

In [18]:
df6 = df3['location']
df6.head()

0    thane
1    thane
2    thane
4    thane
6    thane
Name: location, dtype: object

In [19]:
df6 = pd.get_dummies(df6, columns=['location'], drop_first=True)
df6 = df6.astype(int)
df6.head()

,ahmadnagar,ahmedabad,allahabad,aurangabad,badlapur,bangalore,belgaum,bhiwadi,bhiwandi,bhopal,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [20]:
df7 = pd.concat([df3,df6],axis='columns')

In [21]:
df8 = df7.drop(['location','Price (in rupees)'],axis='columns')
df8.head()

,Amount(in rupees),Carpet Area,Bathroom,Bhk,ahmadnagar,ahmedabad,allahabad,aurangabad,badlapur,bangalore,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,42 Lac,500 sqft,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,98 Lac,473 sqft,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.40 Cr,779 sqft,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.60 Cr,635 sqft,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,16.5 Lac,550 sqft,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [22]:
df8['Carpet Area'] = df8['Carpet Area'].str.extract('(\d+)').astype(int)

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\badam\AppData\Local\Temp\ipykernel_14192\935116368.py:1: SyntaxWarning: invalid escape sequence '\d'
  df8['Carpet Area'] = df8['Carpet Area'].str.extract('(\d+)').astype(int)

In [23]:
df8['Amount(in rupees)'] = df8['Amount(in rupees)'].str.extract(r'(\d+\.?\d*)').astype(float)

In [24]:
df8 = df8.dropna()
df8.head()

,Amount(in rupees),Carpet Area,Bathroom,Bhk,ahmadnagar,ahmedabad,allahabad,aurangabad,badlapur,bangalore,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,42.0,500,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,98.0,473,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.4,779,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.6,635,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,16.5,550,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [25]:
df8

,Amount(in rupees),Carpet Area,Bathroom,Bhk,ahmadnagar,ahmedabad,allahabad,aurangabad,badlapur,bangalore,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,42.00,500,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,98.00,473,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.40,779,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.60,635,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,16.50,550,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
187522,80.00,1200,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
187523,1.19,1705,5,5,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
187524,69.60,895,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
187525,44.90,1050,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
187528,76.00,1250,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [36]:
x = df8.drop('Amount(in rupees)',axis = 'columns')
x.head()
import pickle
pickle.dump(x.columns.tolist(), open("model_columns.pkl", "wb"))

In [27]:
y = df8['Amount(in rupees)']
y

0         42.00
1         98.00
2          1.40
4          1.60
6         16.50
          ...
187522    80.00
187523     1.19
187524    69.60
187525    44.90
187528    76.00
Name: Amount(in rupees), Length: 93488, dtype: float64

In [28]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=10)

In [29]:
df8['Bathroom'] = df8['Bathroom'].replace({'> 10': 11}).astype(int)

In [33]:
df8['Bathroom'].unique()

array([ 1,  2,  3,  4,  6,  5,  7, 10,  9,  8, 11])

In [37]:
lr = LinearRegression()
lr.fit(x_train,y_train)
lr.score(x_test,y_test)

In [ ]:
yp = lr.predict(x_test)
yp

In [ ]:
from sklearn.metrics import confusion_matrix,f1_score,mean_absolute_error,r2_score,recall_score,roc_auc_score,roc_curve,mean_squared_error

In [65]:
print(mean_absolute_error(y_test,yp))
print(mean_squared_error(y_test,yp))

19.81644522587894
639.0343747591396

In [66]:
import numpy as np

In [67]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)

cross_val_score(LinearRegression(), x, y, cv=cv)

array([0.30690249, 0.29777001, 0.30550851, 0.31766065, 0.2992036 ])

In [68]:
from sklearn.ensemble import RandomForestClassifier , RandomForestRegressor
from sklearn.metrics import classification_report,accuracy_score,auc,cohen_kappa_score

In [69]:
rfr = RandomForestRegressor(n_estimators=5)
rfr.fit(x_train,y_train)
ypredict=rfr.predict(x_test)

In [70]:
print(mean_absolute_error(y_test,ypredict))
print(mean_squared_error(y_test,ypredict))

6.3798336361036325
254.0721610392215

In [71]:
rfr.score(x_test,y_test)

0.7231994788402428

In [74]:
x.columns

Index(['Carpet Area', 'Bathroom', 'Bhk', 'ahmadnagar', 'ahmedabad',
       'allahabad', 'aurangabad', 'badlapur', 'bangalore', 'belgaum',
       'bhiwadi', 'bhiwandi', 'bhopal', 'bhubaneswar', 'chandigarh', 'chennai',
       'coimbatore', 'dehradun', 'durgapur', 'ernakulam', 'faridabad',
       'ghaziabad', 'goa', 'greater-noida', 'guntur', 'gurgaon', 'guwahati',
       'gwalior', 'haridwar', 'hyderabad', 'indore', 'jabalpur', 'jaipur',
       'jamshedpur', 'jodhpur', 'kalyan', 'kanpur', 'kochi', 'kolkata',
       'kozhikode', 'lucknow', 'ludhiana', 'madurai', 'mangalore', 'mohali',
       'mumbai', 'mysore', 'nagpur', 'nashik', 'navi-mumbai', 'navsari',
       'nellore', 'new-delhi', 'noida', 'palakkad', 'palghar', 'panchkula',
       'patna', 'pondicherry', 'pune', 'raipur', 'rajahmundry', 'ranchi',
       'satara', 'shimla', 'siliguri', 'solapur', 'sonipat', 'surat', 'thane',
       'thrissur', 'tirupati', 'trichy', 'trivandrum', 'udaipur', 'udupi',
       'vadodara', 'vapi', 'varanasi', 'vijayawada', 'visakhapatnam',
       'vrindavan', 'zirakpur'],
      dtype='object')

In [97]:
def predict_price(location, carpet_area, bathroom, bhk):
    loc_index = np.where(x.columns == location)[0][0]

    x1 = np.zeros(len(x.columns))
    x1[0] = carpet_area
    x1[1] = bathroom
    x1[2] = bhk
    if loc_index >= 0:
        x1[loc_index] = 1

    # Pass as DataFrame with correct column names
    input_df = pd.DataFrame([x1], columns=x.columns)

    # Predict and return as normal Python float rounded to 2 decimals
    predicted_price = rfr.predict(input_df)[0]
    return float(round(predicted_price, 2))

In [98]:
df8.head()

,Amount(in rupees),Carpet Area,Bathroom,Bhk,ahmadnagar,ahmedabad,allahabad,aurangabad,badlapur,bangalore,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,42.0,500,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,98.0,473,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.4,779,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.6,635,2,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,16.5,550,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [99]:
predict_price('ahmedabad',600, 2, 2)

50.03

In [104]:
predict_price('thane',1000, 5, 5)

2.26

In [105]:
import pickle
with open('house_prices_model.pickle','wb') as f:
    pickle.dump(rfr,f)

In [106]:
import json
columns = {
    'data_columns' : [col.lower() for col in x.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))

In [2]:
import pickle
pickle.dump(x.columns.tolist(), open("model_columns.pkl", "wb"))

NameError: name 'x' is not defined